# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session Tensorflow Debug 介绍
#+PROPERTY: header-args:ipython :session Tensorflow Debug 介绍
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
# #+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
# #+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
# #+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: Tensorflow Debug 介绍
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)


** tfdbg TensorBoard 界面介绍
#+BEGIN_SRC ipython :tangle ./linear_regression.py :session tfdbg-2 :exports code :async t :results raw drawer
  import numpy as np
  import tensorflow as tf

  # Truth values for the linear model.
  k_true = [[1, -1], [3, -3], [2, -2]]
  b_true = [-5, 5]
  num_examples = 128

  with tf.Session() as sess:
      # Input place holders.
      x = tf.placeholder(tf.float32, shape=[None, 3], name="x")
      y = tf.placeholder(tf.float32, shape=[None, 2], name="y")

      # Deine model architecture, loss and training operator.
      dense_layer = tf.keras.layers.Dense(2, use_bias=True)
      y_hat = dense_layer(x)
      loss = tf.reduce_mean(
          tf.keras.losses.mean_squared_error(y, y_hat), name="loss")
      train_op = tf.train.GradientDescentOptimizer(0.05).minimize(loss)

      # Initializer model variables.
      sess.run(tf.global_variables_initializer())
      # Saver
      saver = tf.train.Saver()

      for i in range(50):
          # Generate synthetic training data.
          xs = np.random.randn(num_examples, 3)
          ys = np.matmul(xs, k_true) + b_true

          save_path = saver.save(sess, '/tmp/logdir/lin_dbg.ckpt')

          loss_val, _ = sess.run([loss, train_op], feed_dict={x: xs, y: ys})
          print("Iter %d: loss = %g" % (i, loss_val))
#+END_SRC

#+BEGIN_SRC ipython :tangle yes :session tfdbg :exports code :async t :results raw drawer
  import numpy as np
  import tensorflow as tf
  from tensorflow.python import debug as tf_debug

  # Truth values for the linear model.
  k_true = [[1, -1], [3, -3], [2, -2]]
  b_true = [-5, 5]
  num_examples = 128

  # Input place holders.
  x = tf.placeholder(tf.float32, shape=[None, 3], name="x")
  y = tf.placeholder(tf.float32, shape=[None, 2], name="y")

  # Deine model architecture, loss and training operator.
  dense_layer = tf.keras.layers.Dense(2, use_bias=True)
  y_hat = dense_layer(x)
  loss = tf.reduce_mean(
      tf.keras.losses.mean_squared_error(y, y_hat), name="loss")
  train_op = tf.train.GradientDescentOptimizer(0.05).minimize(loss)

  # Init OP
  init_op = tf.global_variables_initializer()

  # Saver
  # saver = tf.train.Saver()

  with tf.Session() as sess:
      # Initializer model variables.
      sess.run(init_op)

      # sess = tf_debug.TensorBoardDebugWrapperSession(sess, "yiddiEdge:7000")

      for i in range(50):
          # Generate synthetic training data.
          xs = np.random.randn(num_examples, 3)
          ys = np.matmul(xs, k_true) + b_true

          # save_path = saver.save(sess, '/tmp/logdir/lin_dbg.ckpt')

          loss_val, _ = sess.run([loss, train_op], feed_dict={x: xs, y: ys})
          print("Iter %d: loss = %g" % (i, loss_val))
#+END_SRC

#+RESULTS:
:RESULTS:
0 - 0eac0512-9001-40a5-aff7-d50b30dfa1a8
:END:


想使用 tfdbg 并对其进行可视化, 注意严格按照如下步骤来,

1. run un-modified python code to produce ~.ckpt~ file
2. execute TB command without --debug flag
3. modify python code, import debug and wrap sess, TB still run now.
4. run modified python code

如果, 完全关闭 TB 之后再修改代码, 会 lead an rpc error.
#+BEGIN_QUOTE
_Rendezvous: <_Rendezvous of RPC that terminated with (StatusCode.UNAVAILABLE,
Connect Failed)>
#+END_QUOTE


1. 需要在 tensorboard 命令行中加入如下参数 ~debugger_port~:

   #+BEGIN_SRC emacs-lisp :tangle yes
   (require 'ob-async)
   #+END_SRC

   #+RESULTS:
   : ob-async

   #+BEGIN_SRC shell :async :results output
   tensorboard --logdir /tmp/logdir --debugger_port 7000
   #+END_SRC

   #+RESULTS:

2. 源码中导入 tensorflow.python.debug

   #+BEGIN_SRC ipython :tangle yes :session :exports code :async t :results raw drawer
     # To connect to the debugger from your tf.Session:
     from tensorflow.python import debug as tf_debug
   #+END_SRC

3. wrap ~sess~ with ~debug.TensorBoardDebugWrapperSession(sess, "local_URL")~

#+BEGIN_SRC ipython :tangle yes :session :exports code :async t :results raw drawer
  sess = tf.Session()
  sess = tf_debug.TensorBoardDebugWrapperSession(sess, "yiddiEdge:7000")
  sess.run(my_fetches)

  # To connect to the debugger using hooks, e.g., from tf.Estimator:
  from tensorflow.python import debug as tf_debug
  hook = tf_debug.TensorBoardDebugHook("yiddiEdge:7000")
  my_estimator.fit(x=x_data, y=y_data, steps=1000, monitors=[hook])
#+END_SRC

** 其他处理部分

#+NAME: process-to-avoid-reload-graph
#+BEGIN_SRC ipython :tangle yes :noweb yes :session lec4-3 :exports code :results raw drawer
   <<get-pid>>
   <<kill-pid>>
   <<del-graph-summary>>
   <<tensorboard-run>>
   <<run-tensorboard>>
#+END_SRC

#+RESULTS: process-to-avoid-reload-graph
:RESULTS:
# Out[4]:
:END:

#+name: get-pid
#+BEGIN_SRC shell :results outputs
ps -aux | grep "python" | grep -E "(default|tfdbg|tensorboard)" | grep -v "grep" | awk '{print $2}'
#+END_SRC

#+RESULTS: get-pid
: 14526

#+name: kill-pid
#+BEGIN_SRC elisp :results outpout :var pid=get-pid
  ;; 取元素
  (defun r1l(tbl)
    (mapcar (lambda (x) (number-to-string (car x))) tbl)
    )
  ;; (print pid)
  ;; (print (reduce-one-layer pid))
  (mapcar #'shell-command-to-string
          (mapcar (lambda (x) (concat "kill " x)) (r1l pid))))
#+END_SRC

#+RESULTS: kill-pid
|   |   |   |   |

#+name: del-graph-summary
#+BEGIN_SRC shell :results output
  rm -rf /tmp/logdir/*
  ls /tmp/logdir
#+END_SRC

#+RESULTS: del-graph-summary




